tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

cask_args appdir: "/Applications"

tap "adoptopenjdk/openjdk"
tap "derailed/k9s"
tap "minio/stable"

brew "gdbm"
brew "openssl@1.1"
brew "gettext"
brew "readline"
brew "python@3.8"
brew "ansible"
brew "snappy"
brew "awscli"
brew "bat"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "glib"
brew "pixman"
brew "ccache"
brew "cfssl"
brew "cloc"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "cpanminus"
brew "ctags"
brew "curl"
brew "editorconfig"
brew "eigen"
brew "exa"
brew "fd"
brew "icu4c"
brew "jpeg"
brew "libtiff"
brew "python"
brew "fswatch"
brew "fzf"
brew "git"
brew "git-flow-avh"
brew "gmp"
brew "libksba"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphviz"
brew "helm"
brew "htop"
brew "hugo"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "openexr"
brew "ios-deploy"
brew "isl"
brew "istioctl"
brew "jq"
brew "kafkacat"
brew "kakoune"
brew "libmemcached"
brew "mpfr"
brew "libmpc"
brew "libpq"
brew "libusbmuxd", args: ["HEAD"]
brew "mas"
brew "maven"
brew "mysql-client"
brew "neovim"
brew "node@12"
brew "operator-sdk"
brew "pipenv"
brew "poppler"
brew "procs"
brew "protobuf"
brew "rclone"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rustup-init"
brew "stormssh"
brew "tbb"
brew "telnet"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"
brew "wrk"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "git-delta"
brew "diff-so-fancy"
brew "direnv"

brew "minio/stable/mc"

cask "adoptopenjdk"
cask "adoptopenjdk11"
cask "adoptopenjdk12"
cask "adoptopenjdk8"
cask "alacritty"
cask "calibre"
cask "docker"
cask "drawio"
cask "gimp"
cask "java8"
cask "jdiskreport"
cask "jetbrains-toolbox"
cask "sequel-pro-nightly"
cask "google-chrome"
cask "skype"
cask "tableplus"
cask "telegram"
cask "vscodium"
cask "joplin"
cask "font-blexmono-nerd-font"
cask "spotify"
cask "font-ibm-plex"

mas "Be Focused", id: 973134470
mas "Enpass", id: 732710998
mas "iZip Unarchiver", id: 717545828
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835

