brew "zlib"
brew "gdbm"
brew "openssl@1.1"
brew "gettext"
brew "readline"
brew "libpng"
brew "glib"
brew "libtiff"
brew "jpeg"
brew "libpq"
brew "snappy"

brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"

# core utils
brew "editorconfig"
brew "ripgrep"
brew "exa"
brew "bat"
brew "fd"
brew "watch"
brew "wget"
brew "wrk"
brew "tldr"
brew "jq"
brew "yq"
brew "htop"
brew "fzf"
brew "git"
brew "git-lfs"

brew "gnupg"

# cloud tools
brew "helm"
brew "protobuf"
brew "kubernetes-cli"
brew "kustomize"
brew "krew"
brew "neovim"

# terminal
brew "tmux"
brew "zsh"
brew "zsh-completions"
brew "git-delta"
brew "diff-so-fancy"
brew "direnv"
brew "fswatch"
brew "starship"

# langluage
brew "python@3.10"
brew "python"
brew "go"
brew "gradle"
brew "maven"
brew "node"

brew "fd"
brew "entr"
brew "clang-format"
brew "golangci-lint"

brew "delve"
brew "grpcurl"
brew "gitui"
brew "procs"
brew "zoxide"
brew "rustup-init"
brew "gcc"
