cask_args appdir: "/Applications"

# core
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# extras
tap "adoptopenjdk/openjdk"
tap "derailed/k9s"

# common libs
brew "zlib"
brew "gdbm"
brew "openssl@1.1"
brew "gettext"
brew "readline"
brew "libpng"
brew "glib"
brew "libtiff"
brew "jpeg"
brew "libpq"
brew "snappy"

brew "ccache"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"

# core utils
brew "editorconfig"
brew "ripgrep"
brew "stormssh"
brew "telnet"
brew "exa"
brew "bat"
brew "fd"
brew "tokei" # count lines of code
brew "tree"
brew "unrar"
brew "watch"
brew "wget"
brew "wrk"
brew "tldr"
brew "jq"
brew "htop"
brew "fzf"
brew "git"
brew "git-flow-avh"

brew "mysql-connector-c"

brew "gnupg"
brew "libksba" # required by gnupg
brew "gmp" # required by gnupg

# cloud tools
brew "operator-sdk"
brew "helm"
brew "protobuf"
brew "kubernetes-cli"
brew "terraform"
brew "kustomize"
brew "kubectx"
brew "stern"
brew "awscli"
brew "ansible"
brew "derailed/k9s/k9s"

# Blogs
brew "hugo"

# terminal
brew "neovim"
brew "tmux"
cask "alacritty"
brew "zsh"
brew "zsh-completions"
brew "git-delta"
brew "diff-so-fancy"
brew "direnv"

# langluage
brew "python@3.8"
brew "python@3.7"
brew "python"
brew "go"

brew "gradle"
brew "maven"
cask "adoptopenjdk"
cask "adoptopenjdk11"
cask "adoptopenjdk/openjdk/adoptopenjdk8"

brew "node@14"
brew "node"
brew "icu4c" # required by node

brew "rustup-init"

# apps
cask "calibre"
cask "docker"
cask "drawio"
cask "gimp"
cask "jdiskreport"

cask "jetbrains-toolbox"
cask "sequel-pro-nightly"
cask "tableplus"
cask "telegram"
cask "vscodium"
cask "joplin"
cask "spotify"
cask "opera"
cask "sublime-text"

cask "font-blexmono-nerd-font"
cask "font-ibm-plex"

# securityes
brew "dnscrypt-proxy"

mas "Be Focused", id: 973134470
mas "Enpass", id: 732710998
mas "Xcode", id: 497799835
