# core
tap "homebrew/bundle"
tap "homebrew/core"
tap "derailed/k9s"
tap "bufbuild/buf"
tap "jesseduffield/lazygit"
tap "tgotwig/linux-dust"
tap "hashicorp/tap"
tap "cantino/mcfly"

# core utils
brew "ripgrep"
brew "stormssh"
brew "exa"
brew "bat"
brew "fzf"
brew "starship"
brew "entr"
brew "htop"
brew "fd"
brew "hyperfine"
brew "sops"
brew "wrk"
brew "grpcurl"
brew "dust"
brew "gitui"
brew "procs"
brew "zoxide"
brew "broot"
brew "direnv"
brew "mcfly"
brew "duf"
brew "xh"
brew "the_silver_searcher"
brew "cheat"
brew "sd"

# cloud tools
brew "helm"
brew "kubernetes-cli"
brew "kustomize"
brew "stern"
brew "ansible"
brew "derailed/k9s/k9s"
brew "kubectx"

brew "caddy"
brew "protobuf"
brew "fswatch"
brew "bufbuild/buf/buf"

brew "git-delta"
brew "jesseduffield/lazygit/lazygit"

# langluage
brew "go"
brew "gcc@5" # for go
brew "rust-analyzer"
brew "sccache"
brew "golangci-lint"
brew "python@3.8"

brew "terraform"

brew "delve"
brew "k3d"
brew "node"
brew "hashicorp/tap/vault"
brew "docker-compose"
