cask_args appdir: "/Applications"

# core
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "hashicorp/tap"
tap "cantino/mcfly"

# extras
tap "AdoptOpenJDK/openjdk"
tap "derailed/k9s"
tap "bufbuild/buf"

# common libs
brew "zlib"
brew "gdbm"
brew "openssl@1.1"
brew "gettext"
brew "readline"
brew "libpng"
brew "glib"
brew "libtiff"
brew "jpeg"
brew "libpq"
brew "snappy"
brew "podman"

brew "ccache"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
# core utils
brew "editorconfig"
brew "ripgrep"
brew "stormssh"
brew "telnet"
brew "exa"
brew "bat"
brew "fd"
brew "tokei" # count lines of code
brew "watch"
brew "wget"
brew "wrk"
brew "tldr"
brew "jq"
brew "yq"
brew "htop"
brew "fzf"
brew "git"
brew "git-flow-avh"
brew "kompose"
brew "git-lfs"
brew "bit-git"
brew "duf"
brew "the_silver_searcher"
brew "mcfly"
brew "xh"
brew "cheat"
brew "sd"

brew "mysql-connector-c"

brew "gnupg"
brew "libksba" # required by gnupg
brew "gmp" # required by gnupg
brew "graphviz"


# cloud tools
brew "helm"
brew "protobuf"
brew "kubernetes-cli"
brew "kustomize"
brew "kubectx"
brew "stern"
brew "awscli"
brew "ansible"
brew "derailed/k9s/k9s"
brew "neovim"

# terminal
brew "tmux"
cask "alacritty"
cask "kitty"
brew "zsh"
brew "zsh-completions"
brew "git-delta"
brew "diff-so-fancy"
brew "direnv"
brew "fswatch"
brew "starship"
brew "jesseduffield/lazygit/lazygit"

# langluage
brew "python@3.8"
brew "python@3.7"
brew "python"
brew "go"
brew "gcc@5"

brew "gradle"
brew "maven"
cask "adoptopenjdk"
cask "adoptopenjdk11"
cask "adoptopenjdk/openjdk/adoptopenjdk8"


brew "node@14"
brew "node"
brew "icu4c" # required by node

brew "rustup-init"
brew "sops"
brew "caddy"
brew "bufbuild/buf/buf"
brew 'fd'
brew 'entr'
brew 'clang-format'
brew 'terraform'

# apps
# cask "calibre"
cask "drawio"
cask "jdiskreport"

cask "jetbrains-toolbox"
cask "tableplus"
cask "joplin"
cask "opera"

cask "font-blex-mono-nerd-font"
cask "font-ibm-plex"
brew 'rust-analyzer'
brew 'sccache'
brew 'golangci-lint'

brew "delve"
brew "grpcurl"
brew "dust"
brew 'gitui'
brew 'procs'
brew 'zoxide'
brew 'broot'
brew 'k3d'
brew "hashicorp/tap/vault"

cask "flutter"
brew "cocoapods"

# securityes
brew "dnscrypt-proxy"

mas "Enpass", id: 732710998
