# core
tap "homebrew/bundle"
tap "homebrew/core"
tap "derailed/k9s"
tap "bufbuild/buf"
tap "jesseduffield/lazygit"

# core utils
brew "ripgrep"
brew "stormssh"
brew "exa"
brew "bat"
brew "fd"
brew "fzf"
brew "starship"

brew "gnupg"
brew "libksba" # required by gnupg
brew "gmp" # required by gnupg

# cloud tools
brew "helm"
brew "kubernetes-cli"
brew "kustomize"
brew "stern"
brew "ansible"
brew "derailed/k9s/k9s"
brew "kubectx"
brew "kompose"


brew "istioctl"
brew "caddy"
brew "protobuf"
brew "fswatch"
brew "bufbuild/buf/buf"
brew "direnv"

brew "git-delta"
brew "jesseduffield/lazygit/lazygit"

# langluage
brew "go"
brew "gcc@5"
brew "bit-git"
brew 'rust-analyzer'
brew 'sccache'
brew 'golangci-lint'
